<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Chef Client for Mac version.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.ChefClient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Chef</string>
        <key>OS</key>
        <string>10.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Processor</key>
    		<string>ChefClientVersionProvider</string>
    		<key>Arguments</key>
    		<dict>
    			<key>os_version</key>
    			<string>%OS%</string>
    		</dict>
    	</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
