<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Chef Client for Mac version.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.ChefClient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Chef</string>
        <key>OS</key>
        <string>10.12</string>
        <key>CHEF_VERSION</key>
        <string>latest</string>
        <key>URL</key>
        <string>https://omnitruck.chef.io/stable/chef/download?p=mac_os_x&amp;pv=%OS%&amp;m=x86_64&amp;v=%CHEF_VERSION%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>%URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/chef*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Chef Software, Inc. (EU3VF8YLX2)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
