<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Chef Client for Mac version and repackages it to be compatible with the OS X startup environment.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.pkg.ChefClientFixed</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Chef</string>
        <key>OS</key>
        <string>10.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.ChefClient</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Processor</key>
    		<string>PkgRootCreator</string>
    		<key>Arguments</key>
    		<dict>
    			<key>pkgroot</key>
    			<string>%RECIPE_CACHE_DIR%/root/</string>
    			<key>pkgdirs</key>
    			<dict>
    				<key>opt</key>
    				<string>0755</string>
    				<key>usr</key>
    				<string>0755</string>
    				<key>usr/bin/</key>
    				<string>0755</string>
    			</dict>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>FlatPkgUnpacker</string>
    		<key>Arguments</key>
    		<dict>
				<key>purge_destination</key>
				<true/>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>PkgPayloadUnpacker</string>
    		<key>Arguments</key>
    		<dict>
				<key>purge_destination</key>
				<true/>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/root/opt/chef</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/chef-core.pkg/Payload</string>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>Symlinker</string>
    		<key>Arguments</key>
    		<dict>
    			<key>source_path</key>
    			<string>/opt/chef/bin/chef-apply</string>
    			<key>destination_path</key>
    			<string>%RECIPE_CACHE_DIR%/root/usr/bin/chef-apply</string>
    			<key>overwrite</key>
    			<true/>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>Symlinker</string>
    		<key>Arguments</key>
    		<dict>
    			<key>source_path</key>
    			<string>/opt/chef/bin/knife</string>
    			<key>destination_path</key>
    			<string>%RECIPE_CACHE_DIR%/root/usr/bin/knife</string>
    			<key>overwrite</key>
    			<true/>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>Symlinker</string>
    		<key>Arguments</key>
    		<dict>
    			<key>source_path</key>
    			<string>/opt/chef/bin/shef</string>
    			<key>destination_path</key>
    			<string>%RECIPE_CACHE_DIR%/root/usr/bin/shef</string>
    			<key>overwrite</key>
    			<true/>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>Symlinker</string>
    		<key>Arguments</key>
    		<dict>
    			<key>source_path</key>
    			<string>/opt/chef/bin/ohai</string>
    			<key>destination_path</key>
    			<string>%RECIPE_CACHE_DIR%/root/usr/bin/ohai</string>
    			<key>overwrite</key>
    			<true/>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>Symlinker</string>
    		<key>Arguments</key>
    		<dict>
    			<key>source_path</key>
    			<string>/opt/chef/bin/chef-client</string>
    			<key>destination_path</key>
    			<string>%RECIPE_CACHE_DIR%/root/usr/bin/chef-client</string>
    			<key>overwrite</key>
    			<true/>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>Symlinker</string>
    		<key>Arguments</key>
    		<dict>
    			<key>source_path</key>
    			<string>/opt/chef/bin/chef-shell</string>
    			<key>destination_path</key>
    			<string>%RECIPE_CACHE_DIR%/root/usr/bin/chef-shell</string>
    			<key>overwrite</key>
    			<true/>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>Symlinker</string>
    		<key>Arguments</key>
    		<dict>
    			<key>source_path</key>
    			<string>/opt/chef/bin/chef-solo</string>
    			<key>destination_path</key>
    			<string>%RECIPE_CACHE_DIR%/root/usr/bin/chef-solo</string>
    			<key>overwrite</key>
    			<true/>
    		</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>Copier</string>
    		<key>Arguments</key>
    		<dict>
    			<key>destination_path</key>
    			<string>%RECIPE_CACHE_DIR%/scripts</string>
    			<key>source_path</key>
    			<string>%RECIPE_DIR%/scripts</string>
    			<key>overwrite</key>
    			<true/>
    		</dict>
    	</dict>
		<dict>
			<key>Processor</key>
			<string>PkgCreator</string>
			<key>Arguments</key>
			<dict>
				<key>pkgname</key>
				<string>%NAME%-%version%</string>
				<key>pkg_request</key>
				<dict>
					<key>pkgdir</key>
					<string>%RECIPE_CACHE_DIR%</string>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/root</string>
					<key>id</key>
					<string>com.getchef.pkg.chef</string>
					<key>options</key>
					<string>purge_ds_stores</string>
					<key>chown</key>
					<array>
						<dict>
							<key>path</key>
							<string>opt</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
						<dict>
							<key>path</key>
							<string>usr</string>
							<key>user</key>
							<string>root</string>
							<key>group</key>
							<string>wheel</string>
						</dict>
					</array>
					<key>scripts</key>
					<string>%RECIPE_CACHE_DIR%/scripts</string>
				</dict>
			</dict>
		</dict>
    </array>
</dict>
</plist>
