<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Pkg up a MAS app if it isn't already packaged.</string>
    <key>Identifier</key>
    <string>com.github.nmcspadden.pkg.appstore</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>/Applications/Numbers.app</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_item</key>
                <string>/Applications/Numbers.app</string>
            </dict>
            <key>Processor</key>
            <string>AppStoreUpdateChecker</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
