Description: |
  This is a slight rewrite of grahampugh-recipes/EclipseTemurin recipes.
  Downloads the current release version of Eclipse Temurin 8. This is based from the tar version rather than the signed pkg version, so that the true version number can be obtained.

  FEATURE_VERSION may be any valid whole number, e.g. 8, 11, 16, 17. See https://api.adoptium.net/v3/info/available_releases for available feature versions.

  RELEASE_TYPE can be 'ga' (general availablility) or 'ea' (early access).

  OS may be 'mac' or others.

  DOWNLOAD_ARCH may be 'x64' or 'aarch64' for macOS-specific builds. Note that if you change this, you MUST also change the supported_architectures in the pkginfo dictionary to match what Munki expects: https://github.com/munki/munki/wiki/Pkginfo-Files#supported_architectures

  IMAGE_TYPE may be 'jdk', 'jre', 'testimage', 'debugimage' or 'staticlibs'.

  JVM_IMPLEMENTATION may be "hotspot", "openj9" or "dragonwell".

  HEAP_SIZE may be 'normal' or 'large'.

  VENDOR may be 'adoptopenjdk', 'openjdk', 'adoptium', 'alibaba', 'ibm'.

  Note that not all options are available for all vendors, and not all listed vendors may be currently available.
Identifier: com.github.nmcspadden.recipes.download.EclipseTemurin
MinimumVersion: "2.3"

Input:
  NAME: EclipseTemurin
  FEATURE_VERSION: "11"
  OS: mac
  RELEASE_TYPE: ga
  DOWNLOAD_ARCH: x64
  IMAGE_TYPE: jdk
  JVM_IMPLEMENTATION: hotspot
  HEAP_SIZE: normal
  VENDOR: adoptium

Process:
  - Processor: URLDownloader
    Arguments:
      url: "https://api.adoptium.net/v3/installer/latest/%FEATURE_VERSION%/%RELEASE_TYPE%/%OS%/%DOWNLOAD_ARCH%/%IMAGE_TYPE%/%JVM_IMPLEMENTATION%/%HEAP_SIZE%/%VENDOR%"
      filename: "%VENDOR%-%FEATURE_VERSION%_%IMAGE_TYPE%_%OS%_%DOWNLOAD_ARCH%_%JVM_IMPLEMENTATION%.pkg"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      expected_authority_names:
        - "Developer ID Installer: Eclipse Foundation, Inc. (JCDTMS22B4)"
        - Developer ID Certification Authority
        - Apple Root CA
      input_path: "%pathname%"
