<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Chef DK for Mac version.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.download.chefdk</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Chef</string>
        <key>OS</key>
        <string>10.11</string>
        <key>URL</key>
        <string>https://downloads.chef.io/chef-dk/mac/</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Processor</key>
    		<string>URLTextSearcher</string>
    		<key>Arguments</key>
    		<dict>
    			<key>url</key>
    			<string>%URL%</string>
                <key>re_pattern</key>
                <string>(mac_os_x\/%OS%\/x86_64\/chefdk-(.*?)\.dmg)</string>
    		</dict>
    	</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
                <key>url</key>
                <string>https://opscode-omnibus-packages.s3.amazonaws.com/%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
