<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads ChefDK installer and installs it from DMG.</string>
    <key>Identifier</key>
    <string>com.bk.autopkg.install.chefdk</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ChefDK</string>
        <key>DESTINATION_PATH</key>
        <string>/Applications/</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.bk.autopkg.pkg.chefdk</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
        </dict>
    </array>
</dict>
</plist>
