<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Takes a downloaded "minecraftedu.jar" from the Caches folder and turns it into a package.</string>
    <key>Identifier</key>
    <string>com.github.nmcspadden.pkg.MinecraftEdu</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MinecraftEdu</string>
	</dict>
	<key>MinimumVersion</key>
    <string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.download.MinecraftEdu</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Processor</key>
    		<string>LastVersionProvider</string>
    	</dict>
   		<dict>
	    	<key>Processor</key>
	    	<string>StopProcessingIf</string>
	    	<key>Arguments</key>
	    	<dict>
	    		<key>predicate</key>
	    		<string>last_version == version</string>
	    	</dict>
    	</dict>  	
    	<dict>
    		<key>Comment</key>
    		<string>Copies .jar into .zip file</string>
    		<key>Processor</key>
    		<string>Copier</string>
    		<key>Arguments</key>
    		<dict>
    			<key>destination_path</key>
    			<string>%RECIPE_CACHE_DIR%/minecraftedu.zip</string>
    			<key>source_path</key>
    			<string>%pathname%</string>
    			<key>overwrite</key>
    			<false/>
    		</dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Unpacks the minecraftedu.zip file</string>
        	<key>Processor</key>
        	<string>Unarchiver</string>
        	<key>Arguments</key>
        	<dict>
        		<key>archive_path</key>
        		<string>%RECIPE_CACHE_DIR%/minecraftedu.zip</string>
        		<key>destination_path</key>
        		<string>%RECIPE_CACHE_DIR%/minecraft_installer/</string>
        		<key>purge_destination</key>
        		<false/>
        	</dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Create a pkg root - /Lib/AppSupp/, /Applications, and /usr/local/libexec</string>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/MinecraftEdu</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>01775</string>
                    <key>Library/Application Support/</key>
                    <string>0775</string>
                    <key>Library/Application Support/minecraftedu</key>
                    <string>0775</string>
                    <key>Library/LaunchAgents/</key>
                    <string>0775</string>
                    <key>usr</key>
                    <string>01775</string>
                    <key>usr/local/</key>
                    <string>0775</string>
                    <key>usr/local/libexec/</key>
                    <string>0775</string>
                    <key>Applications</key>
                    <string>01775</string>
                </dict>
            </dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Extract the contents of "launcher.zip"</string>
        	<key>Processor</key>
        	<string>Unarchiver</string>
        	<key>Arguments</key>
        	<dict>
        		<key>archive_path</key>
        		<string>%RECIPE_CACHE_DIR%/minecraft_installer/install_res/launcher.zip</string>
        		<key>destination_path</key>
        		<string>%pkgroot%/Library/Application Support/minecraftedu/</string>
        	</dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Extract the contents of "servertool.zip"</string>
        	<key>Processor</key>
        	<string>Unarchiver</string>
        	<key>Arguments</key>
        	<dict>
        		<key>archive_path</key>
        		<string>%RECIPE_CACHE_DIR%/minecraft_installer/install_res/servertool.zip</string>
        		<key>destination_path</key>
        		<string>%pkgroot%/Library/Application Support/minecraftedu/</string>
        	</dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Extract the .app from the .app.zip file</string>
        	<key>Processor</key>
        	<string>ParentUnarchiver</string>
        	<key>Arguments</key>
        	<dict>
        		<key>archive_path</key>
        		<string>MinecraftEDU.app.zip</string>
        		<key>destination_path</key>
        		<string>%pkgroot%/Applications/</string>
        	</dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Copy the LaunchAgent into the pkgroot</string>
        	<key>Processor</key>
        	<string>ParentCopier</string>
        	<key>Arguments</key>
        	<dict>
        		<key>source_path</key>
        		<string>org.sacredsf.minecraftedu.plist</string>
        		<key>destination_path</key>
        		<string>%pkgroot%/Library/LaunchAgents/</string>
        	</dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Copy the LaunchAgent script into /usr/local/libexec</string>
        	<key>Processor</key>
        	<string>ParentCopier</string>
        	<key>Arguments</key>
        	<dict>
        		<key>source_path</key>
        		<string>VerifyMinecraftEdu.sh</string>
        		<key>destination_path</key>
        		<string>%pkgroot%/usr/local/libexec/</string>
        	</dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Make PackageInfo file for our package</string>
            <key>Processor</key>
            <string>PkgInfoCreator</string>
            <key>Arguments</key>
            <dict>
                <key>template_path</key>
                <string>PackageInfoTemplate</string>
                <key>infofile</key>
                <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                <key>pkgtype</key>
                <string>flat</string>
                <key>version</key>
                <string>%version%</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Finally! Build a real Apple package from Minecraft's Java installer</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%/</string>
                    <key>id</key>
                    <string>org.sacredsf.pkg.minecraftedu</string>
                    <key>infofile</key>
                    <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Clean up after ourselves</string>
        	<key>Processor</key>
        	<string>PathDeleter</string>
        	<key>Arguments</key>
        	<dict>
        		<key>path_list</key>
        		<array>
        			<string>%RECIPE_CACHE_DIR%/minecraft_installer</string>
        			<string>%RECIPE_CACHE_DIR%/MinecraftEdu</string>
        			<string>%RECIPE_CACHE_DIR%/minecraftedu.zip</string>
        		</array>
        	</dict>
        </dict>
    </array>
</dict>
</plist>
