<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Dragon Dictate For Mac 3 version.</string>
    <key>Identifier</key>
    <string>com.github.download.DragonDictate3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DragonDictate3</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is no longer supported. Please remove it from your recipe list.</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
