<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Checks for the update of a MAS app.  If the version on disk is up to date, then create a package out of it.  If out of date, abort. If pyasn1 is installed, updates will be checked beforehand from the App Store.  Install pyasn1 here: sudo pip install git+https://github.com/geertj/python-asn1.git#egg=pyasn1</string>
    <key>Identifier</key>
    <string>com.github.nmcspadden.pkg.appstore</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AppStoreApp</string>
        <key>PATH</key>
        <string>/Applications/%NAME%.app</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.0</string>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.check.appstore</string>
    <key>Process</key>
    <array>
		<dict>
	    	<key>Processor</key>
	    	<string>StopProcessingIf</string>
	    	<key>Arguments</key>
	    	<dict>
	    		<key>predicate</key>
	    		<string>update_available == YES</string>
	    	</dict>
    	</dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%PATH%</string>
                <key>destination_path</key>
                <string>%pkgroot%/%PATH%</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>PkgInfoCreator</string>
        	<key>Arguments</key>
        	<dict>
                <key>template_path</key>
                <string>PackageInfoTemplate</string>
                <key>infofile</key>
                <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                <key>pkgtype</key>
                <string>flat</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
