<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Pkg up a MAS app. REQUIRES: https://github.com/geertj/python-asn1</string>
    <key>Identifier</key>
    <string>com.github.nmcspadden.pkg.appstore</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>/Applications/Safari.app</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.check.appstore</string>
    <key>Process</key>
    <array>
		<dict>
	    	<key>Processor</key>
	    	<string>StopProcessingIf</string>
	    	<key>Arguments</key>
	    	<dict>
	    		<key>predicate</key>
	    		<string>update_available == YES</string>
	    	</dict>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>AppStoreReceiptParser</string>
    		<key>Arguments</key>
    		<dict>
    			<key>path</key>
    			<string>%NAME%</string>
    		</dict>
    	</dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%appname%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%NAME%</string>
                <key>destination_path</key>
                <string>%pkgroot%/%NAME%</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>PkgInfoCreator</string>
        	<key>Arguments</key>
        	<dict>
                <key>template_path</key>
                <string>PackageInfoTemplate</string>
                <key>infofile</key>
                <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                <key>pkgtype</key>
                <string>flat</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>IDPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%appname%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>%bundleid%</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Applications</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
        	<key>Comment</key>
        	<string>Clean up after ourselves</string>
        	<key>Processor</key>
        	<string>PathDeleter</string>
        	<key>Arguments</key>
        	<dict>
        		<key>path_list</key>
        		<array>
        			<string>%RECIPE_CACHE_DIR%/%appname%</string>
        			<string>%RECIPE_CACHE_DIR%/PackageInfo</string>
        		</array>
        	</dict>
        </dict>
    </array>
</dict>
</plist>
