<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Downloads the latest version of DbVisualizer.

To download Apple Silicon use: "aarch64" in the DOWNLOAD_ARCH variable
To download Intel use: "x64" in the DOWNLOAD_ARCH variable (default)

DOWNLOAD_VERSION can be:
- "download" for the latest version (default)
- "download/MajorVersion.MinorVersion" for example: download/24.3

See https://www.dbvis.com/version-list/ for all listed versions</string>
		<key>Identifier</key>
		<string>com.github.nmcspadden.download.dbvisualizer</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>DbVisualizer</string>
			<key>VERSION</key>
			<string>download</string>
			<key>DOWNLOAD_ARCH</key>
			<string>x64</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.5.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>href=\"(/product_download/dbvis-([0-9]+(\.[0-9]+)+)/media/dbvis_macos-%DOWNLOAD_ARCH%_([0-9]+(_[0-9]+)+)\.dmg)\"</string>
					<key>result_output_var_name</key>
					<string>DOWNLOAD_URL</string>
					<key>url</key>
					<string>https://www.dbvis.com/%VERSION%</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://www.dbvis.com%DOWNLOAD_URL%</string>
					<key>filename</key>
					<string>%NAME%-%DOWNLOAD_ARCH%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/DbVisualizer.app/Contents/Info.plist</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
		</array>
	</dict>
</plist>
