<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Downloads the latest version of DbVisualizer.
		
Valid values for ARCH include:
- "x64" (default, Intel)
- "aarch64" (Apple Silicon)

Tested with VERSION values: 24.2, 24.1, 23.2, 23.1, and 14.0
</string>
		<key>Identifier</key>
		<string>com.github.nmcspadden.download.dbvisualizer</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>DbVisualizer</string>
			<key>VERSION</key>
			<string>24.2</string>
			<key>ARCH</key>
			<string>x64</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.5.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>href="(https://www\.dbvis\.com/download/%VERSION%/)"</string>
					<key>url</key>
					<string>https://www.dbvis.com/version-list/</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>href="/(product_download/dbvis-[\d\.]+/media/dbvis_macos-%ARCH%_[\d_]+\.dmg)"</string>
					<key>url</key>
					<string>%match%</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://www.dbvis.com/%match%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
