<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Dragon Dictate For Mac 3 version and imports into Munki.  Does not include licensing, nor bypassing Accessibility requirements.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.munki.DragonDictate3</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DragonDictate3</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>display_name</key>
            <string>DragonDictate</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.DragonDictate3</string>
    <key>Process</key>
    <array>
    	<dict>
    		<key>Processor</key>
    		<string>Unarchiver</string>
    	</dict>
    	<dict>
    		<key>Processor</key>
    		<string>DmgCreator</string>
    		<key>Arguments</key>
    		<dict>
    			<key>dmg_root</key>
    			<string>%RECIPE_CACHE_DIR%/%NAME%</string>
    			<key>dmg_path</key>
    			<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
    		</dict>
    	</dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
