<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Imports the VMwareFusion mass deployment package into Munki. Requires justinrummel-recipes to download. You can substitute your own deploy.ini file in an override by placing the content in the DEPLOY_INI_FILE input variable. At a minimum, you'll need to put your license key in (replace the XXXXXs), or the postflight will fail.</string>
		<key>Identifier</key>
		<string>com.github.nmcspadden.munki.deploy.VMwareFusion</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/VMware</string>
			<key>NAME</key>
			<string>VMwareFusion</string>
			<key>pkginfo</key>
			<dict>
				<key>blocking_applications</key>
				<array>
					<string>VMware Fusion.app</string>
				</array>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>Productivity</string>
				<key>description</key>
				<string></string>
				<key>developer</key>
				<string>VMware</string>
				<key>display_name</key>
				<string>VMWare Fusion Pro</string>
				<key>minimum_os_version</key>
				<string>10.13</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>uninstall_method</key>
				<string>uninstall_script</string>
				<key>uninstall_script</key>
				<string>#!/bin/sh
/bin/rm -rf /Applications/VMware\ Fusion.app
/bin/rm -f /Library/Preferences/VMware Fusion/config
				</string>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.5</string>
		<key>ParentRecipe</key>
		<string>com.github.nmcspadden.pkg.deploy.VMwareFusion</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/DeployVMwareFusion.dmg</string>
					<key>dmg_root</key>
					<string>%pkgroot%</string>
				</dict>
				<key>Processor</key>
				<string>DmgCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>minimum_os_version</key>
						<string>%ls_minimum_system_version%</string>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/DeployVMwareFusion.dmg</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
