<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Copyright</key>
		<string>Copyright (c) Facebook, Inc. and its affiliates. All Rights Reserved</string>
		<key>Description</key>
		<string>Takes the EXTRACTED DMG and imports into Munki.</string>
		<key>Identifier</key>
		<string>com.github.nmcspadden.munki.android_ndk</string>
		<key>Input</key>
		<dict>
			<key>DESTINATION_PATH</key>
			<string>/opt/android_ndk</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/%NAME%</string>
			<key>NAME</key>
			<string>android_ndk</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>Developer Tools</string>
				<key>description</key>
				<string>Android NDK. Be sure to set your ENV variable for ANDROID_NDK_REPOSITORY to /opt/android_ndk/.</string>
				<key>developer</key>
				<string>Google</string>
				<key>display_name</key>
				<string>Android NDK</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.github.nmcspadden.dmg.android_ndk</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>name</key>
						<string>%NAME%_%release_num%</string>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>installs_item_paths</key>
					<array>
						<string>/opt/android_ndk/%NAME%_%release_num%/</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>MunkiInstallsItemsCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_makepkginfo_options</key>
					<array>
						<string>--itemname=opt/android_ndk/android-ndk-%release_num%</string>
						<string>--destinationpath=%DESTINATION_PATH%</string>
						<string>--owner=root</string>
						<string>--group=wheel</string>
						<string>--mode=u+rwx,go+rwx</string>
					</array>
					<key>pkg_path</key>
					<string>%dmg_path%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
