<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages the latest Minecraft release, and imports it into Munki.  THIS RECIPE REQUIRES JAVA TO SUCCESSFULLY RUN.</string>
    <key>Identifier</key>
    <string>com.github.nmcspadden.munki.minecraft</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>Minecraft</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Minecraft with LaunchAgent to install into user's home directories.</string>
            <key>display_name</key>
            <string>Minecraft</string>
            <key>minimum_os_version</key>
            <string>10.7.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>requires</key>
            <array>
            	<string>Java6_Apple</string>
            </array>
            <key>unattended_install</key>
            <true/>
		</dict>
	</dict>
    <key>ParentRecipe</key>
    <string>com.github.nmcspadden.pkg.minecraft</string>
   <key>Process</key>
    <array>
    	<dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
