<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of MinecraftEdu.  Be sure to replace your username and password.  If you do not want to put your password in plaintext, you can use a hash of it generated here: http://minecraftedu.com/api/api.php?action=gethash&amp;username=yourusername&amp;password=yourpassword</string>
    <key>Identifier</key>
    <string>com.github.nmcspadden.download.MinecraftEdu</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>minecraft</string>
        <key>USERNAME</key>
        <string>username</string>
        <key>PASSWORD</key>
        <string>password</string>
        <key>HASHED</key>
        <string>true</string>
        <key>TYPE</key>
        <string>stable</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is no longer supported. Please remove it from your recipe list.</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
